app/controllers/api/v1/articles_controller.rb

  def index
    articles=Article.all
---
SELECT "articles".* FROM "articles"

  def show
    article=Article.find_by(id: params[:id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

  def create
    article=Article.new(
      title: arti_params[:title],
      body: arti_params[:body],
      author: arti_params[:author]
    )
    if article.save
---
INSERT INTO "articles" ("title", "body", "author", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "programing languages"], ["body", "programing languages"], ["author", "abhishek"], ["created_at", "2023-07-06 13:14:20.828542"], ["updated_at", "2023-07-06 13:14:20.828542"]]

  def update
    article=Article.find_by(id: params[:id])
    if article
      article.update(title: params[:title], body: params[:body], author: params[:author])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "body" = ?, "author" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "article changed"], ["body", "updated body is changed"], ["author", "author is also changed"], ["updated_at", "2023-07-06 12:55:31.390980"], ["id", 1]]

  def destroy
    article=Article.find_by(id: params[:id])
    if article
      article.destroy
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 1]]